---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFileModelOptions.CacheSize
source: html/4a09e897-af41-c43f-7568-199e7b5e2b19.htm
---
# Autodesk.Revit.DB.IFC.IFCFileModelOptions.CacheSize Property

The cache size of the file.

## Syntax (C#)
```csharp
public int CacheSize { get; set; }
```